#pragma once
#include "UndeadBaseclass.h"
#include <vector>
class AsylumHandler
{
public:
	AsylumHandler();
	~AsylumHandler();
	void nextDay();
	void start();
	const std::vector<UndeadBaseclass*> getList();
	unsigned int getDays() { return days; };
	void showStats();
private:
	unsigned int days = 0;
	double averageCapacity = 0.0f;
	std::vector<UndeadBaseclass*> pacientList;
	std::vector<UndeadBaseclass*> curedList;
	std::vector<UndeadBaseclass*> forcedOutList;
	std::vector<UndeadBaseclass*> refusedList;

	std::wstring generateName(bool sex);
	const std::vector<std::wstring> maleNames = { L"Володимир", L"Аарон", L"Августин", L"Авесалом", L"Аврелій", L"Адам", L"Адріян", L"Азар", L"Алевтин", L"Альберт", L"Амвросій", L"Амнон", L"Амос", L"Анастас", L"Андрій", L"Антоній", L"Аркадій", L"Арсен", L"Артем", L"Архип", L"Артем", L"Атанас", L"Аскольд", L"Бернард", L"Благослав", L"Богдан", L"Богодар", L"Богомил", L"Богуслав", L"Болеслав", L"Божидар", L"Борис", L"Борислав", L"Боронислав", L"Вадим", L"Валентин", L"Валерій", L"Варфоломій", L"Василь", L"Венедикт", L"Веніямин", L"Віктор", L"Віталій", L"Владислав", L"В'ячеслав", L"Гаврило", L"Геннадій", L"Георгій", L"Герман", L"Гордій", L"Григорій", L"Гліб", L"Данило", L"Давид", L"Дан", L"Даян", L"Демид", L"Дем'ян", L"Дмитро", L"Добромил", L"Доброслав", L"Домінік", L"Драган", L"Драгомир", L"Драгослав", L"Душан", L"Захар", L"Зенон", L"Зигмунд", L"Зиновій", L"Зорян", L"Іван", L"Ігнат", L"Ігор", L"Ілля", L"Іреней", L"Ісай", L"Едуард", L"Еміль", L"Ерік", L"Езра", L"Євген", L"Єлезар", L"Єлисей", L"Єремій", L"Єфрем", L"Йоав", L"Йона", L"Йонатан", L"Йосип", L"Йосафат", L"Йордан", L"Каміл", L"Карпо", L"Казимир", L"Кенан", L"Климент", L"Корнило", L"Корнилій", L"Костянтин", L"Кузьма", L"Кирило", L"Лаврін", L"Левко", L"Лесь", L"Леон", L"Леонід", L"Леонтій", L"Леопольд", L"Лука", L"Лук'ян", L"Натан", L"Кирило", L"Макар", L"Максим", L"Маркіян", L"Марко", L"Мартин", L"Мар'ян", L"Матвій", L"Маттій", L"Мелетій", L"Методій", L"Мілен", L"Мілош", L"Микита", L"Микола", L"Мирон", L"Мирослав", L"Михайло", L"Младен", L"Мойсей", L"Назар", L"Нестор", L"Никанор", L"Никифор", L"Ной", L"Олег", L"Олекса", L"Олександр", L"Олесь", L"Омелян", L"Онисим", L"Онисифор", L"Опанас", L"Орест", L"Остап", L"Охрім", L"Петро", L"Павло", L"Панас", L"Пантелеймон", L"Пармен", L"Патрик", L"Пилип", L"Пламен", L"Прохір", L"Радомир", L"Радослав", L"Рафаїл", L"Роберт", L"Роман", L"Ростислав", L"Рувим", L"Рудольф", L"Руслан", L"Самійло", L"Самуїл", L"Світлан", L"Святослав", L"Северин", L"Семен", L"Серафим", L"Сергій", L"Силуан", L"Симеон", L"Симон", L"Соломон", L"Спас", L"Станимир", L"Станіслав", L"Степан", L"Стефан", L"Стоян", L"Тарас", L"Теодор", L"Тимотей", L"Тимофій", L"Тимур", L"Тит", L"Трохим", L"Уриїл", L"Устим", L"Федір", L"Феофан", L"Филемон", L"Франц", L"Фредрік", L"Хома", L"Християн", L"Христофор", L"Ювеналій", L"Юлій", L"Юліан", L"Юрій", L"Юст", L"Юхим", L"Яків", L"Ярема", L"Яромир", L"Ярослав", L"Ясен", L"Ясон" };
	const std::vector<std::wstring> femaleNames = { L"Ада", L"Аліна", L"Алла", L"Альбіна", L"Амалія", L"Анастасія", L"Аніта", L"Анжела", L"Ганна", L"Біляна", L"Богуслава", L"Богдана", L"Божена", L"Валентина", L"Валерія", L"Варвара", L"Василина", L"Велана", L"Вероніка", L"Весна", L"Вікторія", L"Віолетта", L"Віра", L"Володимира", L"Галина", L"Гордана", L"Дар‘я", L"Данна", L"Дарина", L"Драга", L"Едита", L"Єва", L"Єлисавета", L"Емілія", L"Еріка", L"Ірина", L"Ірена", L"Злата", L"Златослава", L"Камілла", L"Кася", L"Клавдія", L"Лариса", L"Лаура", L"Ліза", L"Лілія", L"Лія", L"Людмила", L"Любов", L"Магда", L"Магдалина", L"Марія", L"Марина", L"Марта", L"Мар'яна", L"Маруся", L"Михайлина", L"Мілена", L"Міяна", L"Надія", L"Наталія", L"Павлина", L"Пріска", L"Розалія", L"Сара", L"Сесілія", L"Святослава", L"Сніжана", L"Соломія", L"Софія", L"Одарка", L"Оксана", L"Оксенія", L"Олександра", L"Олена", L"Ольга", L"Орина", L"Орися", L"Рахіль", L"Ревека", L"Роксолана", L"Світлана", L"Степанія", L"Тереза", L"Тетяна", L"Юлія", L"Юстина", L"Пилипина", L"Христина", L"Яна", L"Ярина", L"Ярослава", L"Ясна" };
	const std::vector<std::wstring> lastNames = { L"Зеленський", L"Мельник", L"Шевченко", L"Коваленко", L"Бондаренко", L"Бойко", L"Ткаченко", L"Кравченко", L"Ковальчук", L"Коваль", L"Олійник", L"Шевчук", L"Поліщук", L"Іванова", L"Ткачук", L"Савченко", L"Бондар", L"Марченко", L"Руденко", L"Мороз", L"Лисенко", L"Петренко", L"Клименко", L"Павленко", L"Кравчук", L"Іванов", L"Кузьменко", L"Пономаренко", L"Савчук", L"Василенко", L"Левченко", L"Харченко", L"Сидоренко", L"Карпенко", L"Гаврилюк", L"Швець", L"Мельничук" };
};